artillery/stress-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  # target: http://backend.dev.housingbayarea.int
  target: "{{ $env.URL }}"
  processor: lib/fake-app-for-artillery.ts
  payload:
    path: "users.csv"
    fields:
      - "email"
      - "password"
  phases:
    - duration: "5m"
      arrivalRate: 1
      maxVusers: 100
      rampTo: 30
      name: RampUp
    # - duration: 1800
    #   arrivalRate: 20
    #   name: Double the load
    # - duration: 1800
    #   arrivalRate: 30
    #   name: triple the load
    # - duration: 1h
    #   arrivalRate: 2
    #   name: First Hour
    # - duration: 6h
    #   arrivalRate: 3
    #   name: Bulk of test
  # # Load & configure a couple of useful plugins
  # # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    expect: {}
    fake-data: {}
  apdex:
    threshold: 100
  ensure:
    maxErrorRate: 1
    thresholds:
      - http.response_time.p99: 4000
      - http.response_time.p95: 2000
  variables:
    url: "{{ $env.URL }}"
    listingId: "{{ $env.LISTING }}"
scenarios:
  - name: Get combined listings
    weight: 8
    flow:
      - post:
          url: /listings/combined
          expect:
            - statusCode: 201
  - name: Get combined listings with a 2BR filter
    weight: 2
    flow:
      - post:
          url: /listings/combined
          body:
            json:
              filter:
                $comparison: "="
                bedrooms: 2
          expect:
            - statusCode: 201
      # - get:
      #     url: /listings/{{ listingId }}
      #     expect:
      #       - statusCode: 200
      # - post:
      #     url: /auth/login
      #     json:
      #       email: "{{ email }}"
      #       password: "{{ password }}"
      #       expect:
      #         - statusCode: 200
      # - post:
      #     url: /applications
      #     beforeRequest:
      #       - generateApplication
      #     capture:
      #       json: $.body
      #       as: body
      #     log: "{{ body }}"
      #     expect:
      #       - statusCode: 201